app/controllers/auth_controller.rb

  def login
    @user = User.find_by!(username: login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sandra"], ["LIMIT", 1]]