app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "date_start", "date_finish", "total", "responsable_id", "participants", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    if @event.save