app/controllers/responsables_controller.rb

  def index
    @responsables = Responsable.all
---
SELECT "responsables".* FROM "responsables"

  def create

    @responsable = Responsable.new(responsable_params)

    if @responsable.save
---
INSERT INTO "responsables" ("name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Francisco"], ["last_name", "Perez"], ["created_at", "2024-09-13 21:36:32.766005"], ["updated_at", "2024-09-13 21:36:32.766005"]]