app/controllers/users_controller.rb

  def index
    @users = User.all

    render json: {
      users: @users.map{|u| UserSerializer.new(u)}
---
SELECT "users".* FROM "users"

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "sandra"], ["password_digest", "[FILTERED]"], ["bio", nil], ["created_at", "2024-09-14 16:47:27.839925"], ["updated_at", "2024-09-14 16:47:27.839925"]]